<template>
  <div class="my-20 ml-4 mr-7">
    <div class="text-2xl font-bold">淺談美妝與科技的跨領域結合</div>
    <SizeBox height="10" />
    <div class="mr-5">
      在強調跨領域多元融合的如今，深度學習及AI技術逐漸成熟，並開始被廣泛運用在不同的應用以及產業上，為未來科技帶來更多發展的可能性，可謂是又造成了一波新時代的科學數據革命。
      <br />
      <br />
      人臉顏值預測(Facial Beauty
      Prediction)技術，便是順應此一浪潮誕生的新興議題。隨著人臉辨識的泛用，人類也開始思考要如何讓AI也能學習美醜之判定。但人類本身對於美醜的定義便不盡相同，要讓機器學習如何評判美醜一事，更是讓人傷透腦筋。所以如何從專業客觀的角度，分析臉部特徵，計算一個可靠的評分公式，成為近年來許多人關注的議題。
      而本實驗室除了針對此人臉顏值預測的議題之外，也想透過科技與藝術跨領域的結合，研究如何將妝容評分判定融入此議題，並開發出能進行客觀評分之美妝判定AI模型，期盼能幫助業界與學界對這個問題有更進一步的了解與答案，並推廣美妝教育的重要性以及未來發展趨勢。
      <br />
      <br />
      然而對於訓練出一個好的AI /
      深度學習模型，最重要的條件之一便是能擁有一個好的訓練和驗證資料集。但標註龐大的資料集往往會曠日廢時，尤其是與視覺相關的資料標註上更耗費人力，其準確率及專業性也將會是一大問題。為針對此問題，本計畫希望透過廣邀美妝相關專業領域的人士或學生將自己的美妝作品上傳至本實驗室網站的方式來收集更多元豐富的樣本資料，上傳資料者可以透過網站上已有的模型來即時獲取其上傳之作品圖片的分數。本網站也會將合作學校師生上傳之作品放在網站上供相關領域專業人士進行評分，並請之針對不同類別的妝容進行1-5分之給分。而此分數也會作為資料集的基準真相(ground
      truth)
      讓模型進行訓練。模型會透過其卷積神經網絡結構學習資料集圖片與評分的相關性 :
      一開始先對圖像做預處理，讓資料的輸入更有效益，並計算經過處裡之圖像數據的部分關鍵特徵與基準真相之間是否存在某種線性關係，如此透過大量的資料推論演算來得出每個關鍵特徵的權重值。
      <br />
      <br />
      此後便可藉由此訓練完成的模型來對輸入的資料進行相同的演算，進而推算出一個評分的結果。
      如同一開始所述，若是能夠有好的資料集，離訓練出一個客觀標準的模型才能更進一步。因此除了需要資訊方面的技術，更需要有藝術背景的專業人士幫助，才能相得益彰，將AI技術帶來的效益發揮得淋漓盡致。
      <br />
      <br />
      綜上所述，此計畫希望能夠透過創立新的標註資料集以及網站的協助，能提供一個更為標準，更為專業客觀的妝容評分基準，進而能對美妝產業和學術界做出研究貢獻；也期盼能幫助不論在產業界或學界學習的學生能夠利用此方式來進行更加有效率的學習以及檢定準備。
    </div>
  </div>
</template>

<script setup>
import SizeBox from "@/components/SizeBox.vue";
</script>
